# На вход программе подаются натуральное число n, а затем n целых чисел.
# Написать программу, которая сначала выводит все отрицательные числа, затем нули, а затем все положительные числа.
# Все числа должны быть выведены в том же порядке, в котором они были введены, каждое на отдельной строке.

n = int(input())
s = list()
for _ in range(n):
    s.append(int(input()))

for i in range(len(s)):
    if s[i] < 0:
        print(s[i])
for j in range(len(s)):    
    if s[j] == 0:
        print(s[j])
for p in range(len(s)):    
    if s[p] > 0:
        print(s[p])

