# На вход программе подаются два числа (каждое на отдельной строке): номер дня похудения (целое число) и текущий вес Гвидо (действительное число).
# Программа должна вывести текст в соответствии с условием задачи.
# #<номер дня> ДЕНЬ: ТЕКУЩИЙ ВЕС = <текущий вес Гвидо> кг, ЦЕЛЬ по ВЕСУ = <цель по весу на текущий день> кг

# На входе день и вес , а также указываем переменную (сколько должен терять каждый день)
a, b = int(input()), float(input())
purpose = 0.2
# Перебор дней по похудению
for i in range(1, a + 1):
    p = 100 - i * purpose
if p >= b:
    print(f'Все идет по плану\n#{a} ДЕНЬ: ТЕКУЩИЙ ВЕС = {b} кг, ЦЕЛЬ по ВЕСУ = {p} кг')
else:
    print(f'Что-то пошло не так\n#{a} ДЕНЬ: ТЕКУЩИЙ ВЕС = {b} кг, ЦЕЛЬ по ВЕСУ = {p} кг')
    
    



