# На вход программе подаётся одна строка – никнейм.
# Программа должна вывести текст в соответствии с условием задачи.
# Никнейм должен начинаться с символа @
# Никнейм должен содержать от 5 до 15(включительно) символов (включая первый символ @)
# Никнейм должен содержать только строчные буквы и (или) цифры (помимо первого символа @)

s = input()
body = s[1:]

if s.startswith("@") and 5 <= len(s) <= 15 and body.isalnum() and body == body.lower():
    print("Correct")
else:
    print("Incorrect")

