# Условие: даны натуральное число n, затем n названий классов (каждое на новой строке).
# Название корректно, если оно имеет вид <номер><буква>, где номер — цифра от 0 до 9,
# а буква — от «А» до «П» включительно (буквы «Ё» нет в алфавите).
# Для каждого названия вывести YES, если оно корректное, иначе NO.

n = int(input())

for i in range(n):
    name = input()

    
    if len(name) == 2:
        digit = name[0]    
        letter = name[1]   

        if '0' <= digit <= '9' and 'А' <= letter <= 'П':
            print('YES')
        else:
            print('NO')
    else:
        print('NO')