# Накручиваем стоимость ответа
# За каждый символ платят: <код символа Unicode> * 3 пчёлок-coin.
# Сэм заменяет английские буквы eyopaxcETOPAHXCBM
# на визуально такие же русские буквы еуорахсЕТОРАНХСВМ.
# На вход подаётся строка текста.
# Вывести в формате:
# Старая стоимость: <стоимость старого сообщения>🐝
# Новая стоимость: <стоимость нового сообщения>🐝

s = input()
eng = 'eyopaxcETOPAHXCBM'
rus = 'еуорахсЕТОРАНХСВМ'
new = s.translate(str.maketrans(eng, rus))
old_cost = sum(ord(c) * 3 for c in s)
new_cost = sum(ord(c) * 3 for c in new)
print(f"Старая стоимость: {old_cost}🐝")
print(f"Новая стоимость: {new_cost}🐝")