# Условие: на вход подаются строки (по одной на строке), конец последовательности — слово "КОНЕЦ"
# (в последовательность оно не входит). Найти минимальную и максимальную строки
# в лексикографическом порядке и вывести их в формате:
# Минимальная строка ⬇️: <минимальная строка>
# Максимальная строка ⬆️: <максимальная строка>

word = input()
minimum = word
maximum = word

while word != 'КОНЕЦ':
    if word < minimum:
        minimum = word
    if word > maximum:
        maximum = word
    word = input()

print('Минимальная строка ⬇️:', minimum)
print('Максимальная строка ⬆️:', maximum)