# На вход программе подаются два целых числа a и b, каждое на отдельной строке.
# Программа должна вывести текст в соответствии с условием задачи:
# Для чисел <число a> и <число b>:
# Сумма кубов: <число a>**3 + <число b>**3 = <сумма кубов a и b>
# Куб суммы: (<число a> + <число b>)**3 = <куб суммы a и b>

a, b = int(input()), int(input())
sum_cube = a ** 3 + b ** 3
cube_sum = (a + b) ** 3
print(f'Для чисел {a} и {b}:\n  Сумма кубов: {a}**3 + {b}**3 = {sum_cube}\n  Куб суммы: ({a} + {b})**3 = {cube_sum}')

