# На вход программе подаётся одна строка с буквами русского языка. Написать программу, которая определяет количество гласных и согласных букв и выводит текст в следующем формате:
# Количество гласных букв равно <кол-во гласных букв>
# Количество согласных букв равно <кол-во согласных букв>


n = input().lower()
vowel, consonant = 0, 0

for i in range(len(n)):
    if n[i] in 'ауоыиэяюе':
        vowel += 1
    elif n[i] in 'бвгджзйклмнпрстфхцчшщ':
        consonant += 1
print('Количество гласных букв равно', vowel)
print('Количество согласных букв равно', consonant)
