# Петя и Ваня играют в «Перетягивание числа». Петя увеличивает общее число,
# Ваня уменьшает его. Общая сумма изначально равна 0.
# Создайте две функции:
# move(player, number) - принимает имя игрока и его число, обновляет общий счёт;
# game_over() - возвращает результат: 'Петя' (сумма положительная),
# 'Ваня' (сумма отрицательная) или 'Ничья' (сумма равна нулю).
# В решении не должно быть вызовов функций.

x = 0


def move(player, number):
    global x
    if player == 'Петя':
        x += number
    if player == 'Ваня':
        x -= number 


def game_over():
    if x > 0:
        return 'Петя'
    elif x < 0:
        return 'Ваня'
    else:
        return 'Ничья' 
